# GetLastCoreLayerIndex Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..GetLastCoreLayerIndex Method
CompoundStructure Class See Also
---
Gets the index of the last core layer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int GetLastCoreLayerIndex()
```

Visual Basic
---
```text
Public Function GetLastCoreLayerIndex As Integer
```

Visual C++
---
```text
public:
int GetLastCoreLayerIndex()
```

# ### Return Value
The index of the last core layer.
# Remarks
This is the index on the interior side. You can change the shell/core layer boundary using SetNumberOfShellLayers(ShellLayerType, Int32).
# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace